Staok/stm32_framework/STM32F207IET6_HAL_freeRTOS_Framework/CONFIG/PeriphConfigCore.h
/*hd系列外设，基本定时器6、7，只能用于定时中断，提供更多的同步功能*/
#define STSTEM_TIM6_ENABLE		1
	#define tim6arr STSTEM_TIM6_Period_5K			/*选择定时器6输出频率（预分频系数为60，这里选择重装值）*/
		#define STSTEM_TIM6_Period_1K	(1000-1)
		#define STSTEM_TIM6_Period_2K	(500-1)
		#define STSTEM_TIM6_Period_5K	(200-1)
		#define STSTEM_TIM6_Period_10K	(100-1)
		#define STSTEM_TIM6_Period_20K	(50-1)
		#define STSTEM_TIM6_Period_50K	(20-1)
		#define STSTEM_TIM6_Period_100K	(10-1)
		#define STSTEM_TIM6_Period_200K	(5-1)
#define STSTEM_TIM7_ENABLE		1
	#define tim7arr STSTEM_TIM6_Period_5K			/*选择定时器7输出频率（预分频系数为60，这里选择重装值）*/
		#define STSTEM_TIM7_Period_1K	(1000-1)
		#define STSTEM_TIM7_Period_2K	(500-1)
		#define STSTEM_TIM7_Period_5K	(200-1)
		#define STSTEM_TIM7_Period_10K	(100-1)
		#define STSTEM_TIM7_Period_20K	(50-1)
		#define STSTEM_TIM7_Period_50K	(20-1)
		#define STSTEM_TIM7_Period_100K	(10-1)
		#define STSTEM_TIM7_Period_200K	(5-1)
/*
	关闭定时中断：（先清除中断标志位，再关闭中断）
		__HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM6_Handler);
		
		__HAL_TIM_CLEAR_IT(&TIM76_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM7_Handler);
		
		注： __HAL_TIM_CLEAR_FLAG(&TIM6_Handler,TIM_FLAG_UPDATE);和
			 __HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);效果应该一样
*/


/*开启硬件SPI，x8/xB系列有两个SPI，最高18M位每秒
默认：尽量只用其中一个，多个器件用多个SS使能端，不提供引脚重映射，默认一次发送八位bits数据，SS引脚用户单独定义！
		master模式，MSB First，SS低电平选中器件
		SCK空闲时刻为高电平(时钟极性CPOL=1)（默认）：
			若使用第二跳变沿数据被采样(时钟相位CPHA=1)：数据线在 SCK 的偶数边沿采样（默认）
			若使用第一跳变沿数据被采样(时钟相位CPHA=0)：数据线在 SCK 的奇数边沿采样
引脚：
	SPI1->CS	SPI1->CLK	SPI1->MISO	SPI1->MOSI 	—————— 	SPI2->CS	SPI2->CLK	SPI2->MISO	SPI2->MOSI
	PA4			PA5			PA6			PA7					PB12		PB13		PB14		PB15
*/
#define SYSTEM_SPI1_ENABLE		0		/*使能SPI1*/
#define SYSTEM_SPI2_ENABLE		0		/*使能SPI2*/
/*提供API：
	用户自定SS引脚：
		到PeriphConfig.c里面的
			sys_SPI1_SS_io_Init();		自行更改
			sys_SPI2_SS_io_Init();		自行更改
		以及 到PeriphConfig.h里面的
			#define	SPI1_CS PAout(4)	自行更改
			#define	SPI2_CS PBout(12)	自行更改
	写读函数：(目前只写了SPI1，SPI2如果要用的话同理)
		u8 SPI1_ReadWriteByte_8Byte(u8 TxData) 		读写一个字节
		u8 SPI1_ReadWriteByte_16Byte(u8* TxData) 	连写两个字节并读回，传入一个包含2字节的u8*指针
		u8 SPI1_WriteByte_8Byte(u8 TxData)			写一个字节
		u8 SPI1_WriteByte_16Byte(u8* TxData)		连写两个字节，传入一个包含2字节的u8*指针
		例子：
			u8 Max7219_adr_data[Max7219_regNum][2] = 
			{
				{0x09,0xFF},
				{0x0A,0x08},
				...
			}
			for(i = 0;i < Max7219_regNum;i++)
				SPI1_WriteByte_16Byte(Max7219_adr_data[i]);
	
	设置SPI速度函数：参数可选：
					SPI_BAUDRATEPRESCALER_2 SPI_BAUDRATEPRESCALER_4 SPI_BAUDRATEPRESCALER_8 SPI_BAUDRATEPRESCALER_16 
					SPI_BAUDRATEPRESCALER_32 SPI_BAUDRATEPRESCALER_64 SPI_BAUDRATEPRESCALER_128 SPI_BAUDRATEPRESCALER_256
		void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI1由APB2(60M)分频得来
		void SPI2_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI2由APB1(30M)分频得来
*/

/*对于ADC和DAC，如果Vref+连接到3.0V基准，则要修改程序！*/

/*hd系列外设，DAC两个输出通道 PA4和PA5，默认初始化为12位右对齐，速度最快为250K左右，输出范围 0~Vref+，默认Vref+为3.3V，否则自行更改转换计算*/
/*可选输出 噪声波形 和 三角波波形 ，默认不适用外部触发，可选触发源在初始化函数中修改（有定时器中断和外部中断线9）*/
#define SYSTEM_DAC_OUT1_ENABLE	0
#define SYSTEM_DAC_OUT2_ENABLE	0
/*可用API:
	设置通道1输出电压,vol:0~3.30V
		void DAC_Set_Ch1_Vol(float vol)
	设置通道2输出电压,vol:0~3.30V
		void DAC_Set_Ch2_Vol(float vol)
*/

/*hd系列外设，FSMC*/
/*FSMC为16位数据线，分为四个256MB的块（28跟地址线）（地址从0x6000 0000开始，第二个块开始在0x7000 0000，以此类推），每一块分为四个64MB的区（BANK1~4）*/
/*第一个块用于NOR/SRAM，第二、三个块用于NAND，第四个块用于PC卡，块一属于NOR FLASH控制器，块二、三和四属于NAND FLASH控制器*/
/*
一般接法：（CE前面加一个N，表示CE低有效，其他同理）
	FSMC			SRAM					LCD
	NEx				NCE（低选中）			CS（低选中）
	NOE				NOE（低使能输出）		RD（低读）
	NWE				NWE（高读低写）			WR（低写）
											RS（高数据低命令）——可接至FSMC的一个地址脚如A10
	NUB				NUB（低选高八位）
	NLB				NLB（低选低八位）
	A[x:0]			A[x:0]（地址，可乱序）
	D[15:0]									D[15:0]（数据）
*/
/*原子的FSMC驱动LCD历程的解释：时序选择模式A，RS连接到了A10
	typedef struct
	{
		vu16 LCD_REG;	//0111 1111 1110 0X7FE
		vu16 LCD_RAM;	//1000 0000 0000 0X7FE+0x02
	}LCD_TypeDef;
	#define LCD_BASE        ((u32)(0x6C000000 | 0x000007FE))
	#define LCD             ((LCD_TypeDef *) LCD_BASE)
	
	0x7FE为：	0111 1111 1110（因为FSMC选择了16位模式，实际地址脚为0x7FE再右移1）
	右移之后  0011 1111 1111 此为LCD->LCD_REG的 实际地址脚 情况，此时A10为0，LCD->LCD_RAM的地址为LCD->LCD_REG地址+2
	LCD->LCD_REG 的地址脚 0011 1111 1111		A10为0 	RS低地址
	LCD->LCD_RAM 的地址脚 0100 0000 0001		A10为1	RS高数据
	这样命令和数据就区分开了
	
	然后读写：（读写相关的CS、WR和RD脚等的电平由FSMC自动设置）
		写：	LCD->LCD_REG = LCD_Reg;				//要写的寄存器地址 
				LCD->LCD_RAM = LCD_RegValue;		//写入一个16位数据
		读：	LCD_WR_REG(LCD_Reg);				//先写寄存器地址
				vu16 LCD_RegValue = LCD->LCD_RAM;	//再读出一个16位数据
*/
/*可以用FSMC同时管理LCD和SRAM（对于MCU来说，外部FLASH可以用SPI的FLASH当作文件系统使用（如存图、当USB U盘或者IAP等等），不用上NOR/NAND之流，那是对MPU的）
	这是对于不带LTDC LCD外设的如STM32F429以下的如STM32F1和STM32F40x系列而言
  对于STM32F429，可以用LTDC LCD单独驱动LCD
*/
/*
  如果实际使用了大容量系列和100脚以上系列的片子但是没有LTDC，推荐用FSMC同时管理LCD和SRAM*/
#define SYSTEM_FSMC_ENABLE	1				//是否启用FSMC
	#define SYSTEM_FSMC_use4LCD		1		//启用FSMC用于驱动LCD，则相关代码被编译，相关API可用
	#define SYSTEM_FSMC_use4SRAM	1		//启用FSMC用于驱动SRAM，则相关代码被编译，相关API可用
/*
用于LCD的部分：
	  可用API详看TFTLCD.h

用于SRAM的部分：
	这里默认用的 块1（NORSRAM块）的区域3（区域4留给LCD喽~）（块1的区3和区4分别留给外部RAM和LCD，本模板默认，否则还得改地址）
	默认用于驱动IS62WV51216，地址线范围为A0~A18，数据线范围D0~D15，（NUB、NLB、NWE、NOE、NCE五根控制线都对应接好）
	底层API：（不推荐直接调用，使用自实现的malloc和free）（以字节为单位）
		u32 testsram[250000] __attribute__((at(SRAM1_BANK3_ADDR))); 	//地址定义在外部SRAM中
		void FSMC_SRAM_WriteBuffer(u8 *pBuffer,u32 WriteAddr,u32 n); 	//写 参数：数据指针，外部SRAM内的地址(从0开始)，写入的字节数
		void FSMC_SRAM_ReadBuffer(u8 *pBuffer,u32 ReadAddr,u32 n);   	//读 类似上
*/
/*
内存管理：先到malloc.h里面定义有几块RAM，RAM的标志位，和各个RAM给内存管理分配的空间
	应用层API：（分配内存的数量以字节为单位）
		my_mem_init(InrRAM);				//初始化内部内存池（系统自带）
		my_mem_init(ExRAM1);				//初始化外部内存池（如果不开启SYSTEM_FSMC_use4SRAM则没有这句话）
		
		void myfree(u8 memx,void *ptr);  			//内存释放
		void *mymalloc(u8 memx,u32 size);			//内存分配
		void *myrealloc(u8 memx,void *ptr,u32 size);//重新分配内存
*/



/*_____________系统变量和函数（莫要乱动撒）_______________*/
void sys_ENswd_DISjtag(void);
extern u16	StartUpTimes;					/*用于保存开机次数，储存在最后一个或倒数第二个页*/
extern uint32_t UIDw[3]; 					/*保存STM32内部UID识别码，全球唯一识别码*/
extern uint32_t sysCoreClock; 				/*获取HCLK频率，外设时钟均来自此再分频*/

/*蜂鸣器连接在TIM3的通道4上*/
extern u8 is_buzzer_once;
extern u8 is_buzzer_bibi;
#define buzzer_bibi_once	is_buzzer_once = 1;  //用户使用，蜂鸣器叫唤一声
#define buzzer_bibi_on		is_buzzer_bibi = 1;  //用户使用，蜂鸣器间歇叫唤开启
#define buzzer_bibi_off		is_buzzer_bibi = 0;  //用户使用，蜂鸣器间歇叫唤关闭

u16 sys_GetsysRunTime(u16* mins,u16* secs,u16* _10ms);/*提供获取系统运行时间的函数，具体看源函数处注释*/

void sys_MCU_Init_Seq(void);				/*MCU外设初始化序列，所有初始化写到这里面*/
void sys_Device_Init_Seq(void);				/*器件外设初始化，并开机自检*/

