Staok/stm32_framework/STM32F207IET6_HAL_freeRTOS_Framework/CONFIG/PeriphConfigCore.h
void FaultASSERT(char* FaultMessage);		/*表示初始化有问题，串口提示，指示灯或者蜂鸣器进行提示*/
u8 Stm32_Clock_Init(void);					/*时钟系统配置*/


/*_____________核心外设变量和函数（莫要乱动撒）_______________*/
/*_______________________________时基定时器4___________________________________*/
#if STSTEM_TIM4_ENABLE

	__packed struct TIM4_IT_FLAGS
	{
		u8 _10msec_flag;	//10毫秒标志和计数
		u16 _10msec;
		
		u8 _100msec_flag;	//100毫秒标志和计数
		u16 _100msec;
		
		u8 _300msec_flag;	//300毫秒标志
		
		u8 _1sec_flag;		//1秒标志和计数
		u16 _1sec;
		
		u8 _1min_flag;		//1分钟标志和计数
		u16 _1min;
	};
	extern struct TIM4_IT_FLAGS Timer_IT_flags;
	extern TIM_HandleTypeDef TIM4_Handler;      //通用定时器4句柄 
	void sys_TIM4_ENABLE(void);
#endif

/*_______________________________辅助PWM定时器3___________________________________*/
#if STSTEM_TIM3PWM_ENABLE
	extern TIM_HandleTypeDef 	TIM3_Handler;      	//定时器3句柄
	extern TIM_OC_InitTypeDef 	TIM3_CH1Handler,TIM3_CH2Handler,TIM3_CH3Handler,TIM3_CH4Handler;	//定时器3通道1-4句柄
	#define TIM3PWM_Channel_1	1
	#define TIM3PWM_Channel_2	2
	#define TIM3PWM_Channel_3	3
	#define TIM3PWM_Channel_4	4
	void sys_TIM3PWM_ENABLE(void);
	void TIM3_set_Channel_Pulse(u8 channel,float percent);
#endif


/*_______________________________串口们___________________________________*/
#if SYSTEM_UART1_ENABLE||SYSTEM_UART2_ENABLE||SYSTEM_UART3_ENABLE
	
	#define USART1_RX_BUF_MaxNum 	200 	/*定义用协议0只接受以'\r\n'结尾的数据时可以存在字符数组里面的最大字节数目*/
	#define USART1_RX_FIFO_MaxNum	200		/*定义用协议1用FIFO存储数据时可以存的最大字节数目*/
	
	#define UART1	1
	#define UART2	2
	#define UART3	3
	#define RXBUFFERSIZE   1 					//缓存大小
	extern u8 aRxBuffer1[RXBUFFERSIZE],aRxBuffer2[RXBUFFERSIZE],aRxBuffer3[RXBUFFERSIZE];//HAL库使用的串口接收缓冲
	extern UART_HandleTypeDef UART1_Handler,UART2_Handler,UART3_Handler; //UART句柄
	void sys_USART1_ENABLE(void);
	void sys_USART2_ENABLE(void);
	void sys_USART3_ENABLE(void);
	
	
	#define USART1_RX_DONE_mask 0x8000
	#define USART1_RX_MODE_mask 0x4000
	#define USART1_RX_Rec_r_mask 0x2000
	#define USART1_RX_Num_mask 0x1fff /*0001 1111 1111 1111*/
	
	extern u16 USART1_RX_CONFIG;	/*    x            x           x        x xxxx xxxx xxxx      */
									/*(接受完成) (协议模式0/1) (接收到\r)   串口1接受数据字节计数 */
									/*串口1接受协议：0为只接受以'\r\n'结尾的数据，1为以FIFO先进先出实现接受区，无协议*/
	
	#define USART1_SetDone 		USART1_RX_CONFIG |= (USART1_RX_DONE_mask) /*设置串口1接收完成标志位*/
	#define USART1_SetUnDone 	USART1_RX_CONFIG &= (USART1_RX_MODE_mask) /*在任务中处理完后对串口1标志位进行复位，除了mode位，其他位都写0*/
	#define USART1_SetMode(x) 	USART1_RX_CONFIG |= (((u16)x)<<14) 		/*用户可用，在任务中设置串口1接收协议*/
	#define USART1_isDone 		((USART1_RX_CONFIG) & (USART1_RX_DONE_mask))/*用户用，用于判断是否接受完成一次*/
	#define USART1_RX_ByteNum 	((USART1_RX_CONFIG) & (USART1_RX_Num_mask))/*用户可用，返回接收的字符数量*/
	
//	extern QueueHandle_t Uart1_fifo;
	u8 sys_USART1_RX_Fetch(u8 is_print, char *buf,u16 *RX_ByteNum);
	u8 sys_USART2_RX_Fetch(u8 is_print, char *buf,u16 *RX_ByteNum);
	u8 sys_USART3_RX_Fetch(u8 is_print, char *buf,u16 *RX_ByteNum);
	
	
#endif

/*_______________________________MCO___________________________________*/
#if SYSTEM_MCO_PA8_OUT
	void sys_MCO_Out_Enable(void);				/*MCO在PA8上输出启动，默认时钟源HSE*/
#endif
/*_______________________________IWDG___________________________________*/
#if SYSTEM_IWDG_ENABLE
	extern IWDG_HandleTypeDef IWDG_Handler; //独立看门狗句柄
	void sys_IWDG_ENABLE(void);
	void IWDG_Feed(void);
#endif

/*_______________________________CRC___________________________________*/
#if SYSTEM_CRC_ENABLE
	#define BUFFER_SIZE    114
	extern CRC_HandleTypeDef hcrc;
	extern const uint32_t aDataBuffer[BUFFER_SIZE];
	extern uint32_t uwExpectedCRCValue;
	void sys_CRC_ENABLE(void);
	void HAL_CRC_MspInit(CRC_HandleTypeDef* hcrc);
#endif
/*_______________________________RTC___________________________________*/
#if SYSTEM_RTC_ENABLE
	extern RTC_HandleTypeDef RTC_Handler;  //RTC句柄

	void sys_RTC_Enable(void);						/*RTC配置*/

#endif

/*_______________________________定时器2___________________________________*/
#if STSTEM_TIM2_ENABLE
	extern TIM_HandleTypeDef TIM2_Handler;
	void sys_TIM2_ENABLE(void); //写在预编译外面为了外部文件能够调用
	#if (STSTEM_TIM2_asPWMorCap == 0)
		/*PWM私有变量*/
		#define TIM2PWM_Channel_1	1
		#define TIM2PWM_Channel_2	2
		#define TIM2PWM_Channel_3	3
		#define TIM2PWM_Channel_4	4
		extern TIM_OC_InitTypeDef 	TIM2_CH1Handler,TIM2_CH2Handler,TIM2_CH3Handler,TIM2_CH4Handler;
		void TIM2_set_Channel_Pulse(u8 channel,float percent);
	#elif (STSTEM_TIM2_asPWMorCap == 1)
		/*输入捕获私有变量*/
		extern u8  	TIM2CHx_CAPTURE_STA;	    				
		extern u16	TIM2CHx_CAPTURE_VAL;
		float Peek_TIM2_Cap_Val(void);
		extern TIM_IC_InitTypeDef TIM2_CHxConfig;
		void Process_TIM2_IC_CallBack_Channel_1(void);
		void Process_TIM2_IC_CallBack_Channel_2(void);
		void Process_TIM2_IC_CallBack_Channel_3(void);
		void Process_TIM2_IC_CallBack_Channel_4(void);
	#elif (STSTEM_TIM2_asPWMorCap == 3)
		/*正交解码私有变量*/
		extern TIM_Encoder_InitTypeDef sEncoderConfig;
		extern int32_t EncoderOverflowCount;//定时器溢出次数
		float peek_TIM2_Encoder_Speed(void);
		int32_t peek_TIM2_Encoder_Value(void);
	#endif
#endif

/*_______________________________TIM1PWM___________________________________*/

#if STSTEM_TIM1PWM_ENABLE
		void sys_TIM1PWM_ENABLE(void);
		extern TIM_HandleTypeDef TIM1_Handler;
		#define TIM1PWM_Channel_1	1
		#define TIM1PWM_Channel_2	2
		#define TIM1PWM_Channel_3	3
		#define TIM1PWM_Channel_4	4
		void TIM1_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM1PWM___________________________________*/

#if STSTEM_TIM8PWM_ENABLE
		extern TIM_HandleTypeDef TIM8_Handler;
		void sys_TIM8PWM_ENABLE(void);
		#define TIM8PWM_Channel_1	1
		#define TIM8PWM_Channel_2	2
		#define TIM8PWM_Channel_3	3
		#define TIM8PWM_Channel_4	4
		void TIM8_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM6___________________________________*/

#if STSTEM_TIM6_ENABLE
	void sys_TIM6_ENABLE(void);
	extern TIM_HandleTypeDef TIM6_Handler;
#endif
/*_______________________________TIM7___________________________________*/

#if STSTEM_TIM7_ENABLE
	void sys_TIM7_ENABLE(void);
	extern TIM_HandleTypeDef TIM7_Handler;
#endif


/*_______________________________ADC1___________________________________*/

#if SYSTEM_ADC1_ENABLE
	void ADC_RegularChannelConfig(ADC_HandleTypeDef *AdcHandle, uint32_t Channel, uint32_t Rank, uint32_t SamplingTime);
	u16 Get_Adc(u32 ch);
	#if SYSTEM_ADC1_useScan
		extern DMA_HandleTypeDef  ADC1rxDMA_Handler;
		void ADC_DMA_Cfg(void);
	#endif
	
	extern ADC_HandleTypeDef ADC1_Handler;
	void sys_ADC1_ENABLE(void);
	u32 Get_Adc_Average(u32 ch,u8 times);
	float Get_Temprate(u32 adcx);
#endif

/*_______________________________SPI1、2________________________________*/

